# Importando bibliotecas e realizando configurações

In [ ]:
import psycopg2
import pandas as pd
conn = psycopg2.connect(host="ruby.db.elephantsql.com",database ="zbhwctjp",user ="zbhwctjp", password ="KpKFW6sP3irBObgJf_YJtiCTqyfd-VA2")

# Modelo Conceitual

<img src='https://github.com/RafaelXavierBraga/Organize_Trab_BD1_2020/blob/master/images/bd_modeloconceitual.png'/>

# 9.1 CONSULTAS DAS TABELAS COM TODOS OS DADOS INSERIDOS(Todas)

In [ ]:
pd.read_sql_query("select * from pessoa",conn)

           cpf          nome data_nascimento    senha
0  10104361234     Ana Gomes      1995-01-11   123456
1  12945630790  Sofia Salles      2000-04-22   675893
2  47345893011   Fabio Nunes      1998-10-30   174524
3  58457731459  João Almeida      1970-07-15  Joao123

In [ ]:
pd.read_sql_query("select * from endereco",conn)

    cpf_pessoa logradouro descricao_logradouro  ...  municipio       cep estado
0  10104361234        Rua         Sabino Alves  ...      Serra  29100200     ES
1  12945630790    Avenida        Pedro Nolasco  ...      Serra  29100201     ES
2  47345893011        Rua           Beija Flor  ...  São Paulo  29100202     SP
3  58457731459        Rua         Herman Stern  ...      Serra  29100203     ES

[4 rows x 8 columns]

In [ ]:
pd.read_sql_query("select * from tipo",conn)

   cod_tipo descricao_tipo
0         1          Saque
1         2        Despesa
2         3   Investimento
3         4        Receita
4         5       Depósito

In [ ]:
pd.read_sql_query("select * from transacao",conn)

   cod_transacao   cpf_pessoa  ...  data_operacao    valor
0           1000  47345893011  ...     2020-07-01  14500.0
1           1102  10104361234  ...     2020-07-05   2224.0
2           1006  12945630790  ...     2020-07-08    803.0
3           1010  47345893011  ...     2020-07-10   6125.0
4           1132  47345893011  ...     2020-01-11   5000.0
5           1360  47345893011  ...     2020-06-11   3000.0
6           1456  58457731459  ...     2020-07-14   2500.0
7           1589  12945630790  ...     2020-07-15   1500.0

[8 rows x 6 columns]

In [ ]:
pd.read_sql_query("select * from contato",conn)

    cpf_pessoa             contato
0  10104361234  anagomes@gmail.com
1  10104361234         27997648129
2  47345893011         27998524459
3  47345893011    fNunes@gmail.com
4  12945630790         27998562473
5  58457731459  JAlmeida@gmail.com